"AU Direct Debit" = "Prélèvement automatique AU";

"Affirm" = "Affirm";

"Afterpay" = "Afterpay";

"Alipay" = "Alipay";

"BLIK" = "BLIK";

"Bacs Direct Debit" = "Prélèvement automatique Bacs";

"Bancontact" = "Bancontact";

"Bank" = "Institution financière";

"Boleto" = "Boleto";

"Card" = "Carte";

"Cash App Pay" = "Cash App Pay";

"Clearpay" = "Clearpay";

"EPS" = "EPS";

"FPX" = "FPX";

"GrabPay" = "GrabPay";

"Klarna" = "Klarna";

"Konbini" = "Konbini";

"Link" = "Link";

"NetBanking" = "Netbanking";

"OXXO" = "OXXO";

"PayPal" = "PayPal";

"Przelewy24" = "Przelewy24";

"SEPA Debit" = "Prélèvement SEPA";

"Sofort" = "Sofort";

"Swish" = "Swish";

"Timed out authenticating your payment method -- try again" = "Le délai d'authentification de votre moyen de paiement est dépassé, veuillez réessayer.";

"UPI" = "UPI";

"US Bank Account" = "Compte bancaire aux États-Unis";

"Unknown" = "Inconnu";

"We are unable to authenticate your payment method. Please choose a different payment method and try again." = "Nous ne sommes pas en mesure d'identifier votre moyen de paiement. Veuillez sélectionner un autre moyen de paiement et réessayer.";

"WeChat Pay" = "WeChat Pay";

"giropay" = "Giropay";

"iDEAL" = "iDEAL";
